 <!-- Напишите сценарий PHP, который отображает все числа от 200 до 250, делящиеся на 4. -->

<?php
 echo implode(",",range(200,250,4))."\n";
?>

<!-- Напишите программу PHP для объединения (по индексу) следующих двух массивов.

Примеры массивов:

$array1 = array(array(77, 87), array(23, 45));
$array2 = array("wm-school", "ru"); -->

<?php
$array1 = array(array(77, 87), array(23, 45));
$array2 = array("wm-school", "ru");
function merge_arrays_by_index($x, $y) {
$temp = array(); $temp[] = $x; 
if(is_scalar($y)) {
$temp[] = $y;
}
else {
foreach($y as $k => $v) {
$temp[] = $v;
}
}
return $temp;
}
echo '<pre>'; print_r(array_map('merge_arrays_by_index',$array2, $array1));
?>

<!-- Удалите элемент из указанного массива PHP. После удаления элемента необходимо нормализовать целочисленные ключи. -->

<?php
$x = array(1, 2, 3, 4, 5);
 var_dump($x);
 unset($x[3]);
 $x = array_values($x);
 echo '<br>';
var_dump($x);
?>

<!-- Отображение ключей и значений массива -->

<?php
$ceu = array("Италия" => "Рим", "Люксембург" => "Люксембург", "Бельгия" => "Брюссель", "Дания" => "Копенгаген", "Финляндия" => "Хельсинки", "Франция "=>"Париж", "Словакия"=>"Братислава", "Словения"=>"Любляна", "Германия"=>"Берлин", "Греция"=>"Афины", "Ирландия" => "Дублин", "Нидерланды" => "Амстердам", "Португалия" => "Лиссабон", "Испания" => "Мадрид", "Швеция" => "Стокгольм", "Великобритания" => "Лондон", "Кипр"=>"Никосия", "Литва"=>"Вильнюс", "Чехия"=>"Прага", "Эстония"=>"Таллин"," Польша "=>"Варшава");
asort($ceu);
foreach($ceu as $country => $capital) {
echo "Cтолица $capital - Страна $country"."\n" ;
}
?>